examples/ctrlflowgraph/ctrl_class.cpp.dot
digraph {
	fontname="SansSerif,sans-serif" labeljust=l nojustify=true ranksep=0.35
	node [fillcolor="#fefece" fontname="SansSerif,sans-serif" fontsize=10 height=0.35 shape=box style="filled, rounded"]
	subgraph cluster_item_0 {
		graph [label="::item::funcA(::item::ExampleA * object) -> int"]
		item_1 [label="return 1" fillcolor=lightgreen]
		item_2 [label="" fillcolor=black fixedsize=true height=0.12 shape=doublecircle size=0.1 width=0.12]
		item_1 -> item_2
	}
	subgraph cluster_item_3 {
		graph [label="::item::ExampleB::methodB1(int const param) -> int"]
		item_4 [label="float const var1 = param * 3.2999999999999998223643161e+0"]
		item_5 [label="float const var2 = param * 3.2999999999999998223643161e+0"]
		item_4 -> item_5
		item_6 [label="int const valA"]
		item_5 -> item_6
		item_7 [label="valA = (&objA)->methodA1()"]
		item_6 -> item_7
		item_8 [label="int retX"]
		item_7 -> item_8
		item_9 [label="retX = this->methodB2(var1) * valA"]
		item_8 -> item_9
		item_10 [label="retX = retX + 7"]
		item_9 -> item_10
		item_11 [label="int retY"]
		item_10 -> item_11
		item_12 [label="retY = ::item::ExampleB::methodB3(12)"]
		item_11 -> item_12
		item_13 [label="return retX + retY" fillcolor=lightgreen]
		item_14 [label="" fillcolor=black fixedsize=true height=0.12 shape=doublecircle size=0.1 width=0.12]
		item_13 -> item_14
		item_12 -> item_13
	}
	item_2 -> item_4 [style=invis]
	subgraph cluster_item_15 {
		graph [label="::item::ExampleB::methodB3(int const val) -> int"]
		item_16 [label="return val" fillcolor=lightgreen]
		item_17 [label="" fillcolor=black fixedsize=true height=0.12 shape=doublecircle size=0.1 width=0.12]
		item_16 -> item_17
	}
	item_14 -> item_16 [style=invis]
	subgraph cluster_item_18 {
		graph [label="::item::ExampleB::methodB2(float const param) -> int"]
		item_19 [label="float const var = param * 6.5999999999999996447286321e+0"]
		item_20 [label="return var" fillcolor=lightgreen]
		item_21 [label="" fillcolor=black fixedsize=true height=0.12 shape=doublecircle size=0.1 width=0.12]
		item_20 -> item_21
		item_19 -> item_20
	}
	item_17 -> item_19 [style=invis]
	subgraph cluster_item_22 {
		graph [label="::item::ExampleA::__ct_base() -> void"]
		item_23 [label="(*this) = {}"]
		item_24 [label="__vtbl_ptr_type[] _ZTVN4item8ExampleAE = {[0] = 0, [1] = (&_ZTIN4item8ExampleAE), [2] = (&::item::ExampleA::__dt_comp), [3] = (&::item::ExampleA::__dt_del), [4] = (&::item::ExampleA::methodA1)}"]
		item_23 -> item_24
		item_25 [label="_vptr.ExampleA = (&_ZTVN4item8ExampleAE) + 16"]
		item_24 -> item_25
		item_26 [label="fieldA = 5"]
		item_25 -> item_26
	}
	item_21 -> item_23 [style=invis]
	subgraph cluster_item_27 {
		graph [label="::item::ExampleA::__ct_comp() -> void"]
	}
	subgraph cluster_item_28 {
		graph [label="::item::ExampleA::__dt_base() -> void"]
		item_29 [label="__vtbl_ptr_type[] _ZTVN4item8ExampleAE = {[0] = 0, [1] = (&_ZTIN4item8ExampleAE), [2] = (&::item::ExampleA::__dt_comp), [3] = (&::item::ExampleA::__dt_del), [4] = (&::item::ExampleA::methodA1)}"]
		item_30 [label="_vptr.ExampleA = (&_ZTVN4item8ExampleAE) + 16"]
		item_29 -> item_30
		subgraph cluster_item_31 {
			graph [label=try]
			item_32
		}
		subgraph cluster_item_33 {
			graph [label=finally]
			item_34 [label="(*this) = {}"]
		}
		item_32 -> item_34
		item_30 -> item_32
	}
	item_26 -> item_29 [style=invis]
	subgraph cluster_item_35 {
		graph [label="::item::ExampleA::__dt_comp() -> void"]
	}
	subgraph cluster_item_36 {
		graph [label="::item::ExampleA::__dt_del() -> void"]
		subgraph cluster_item_37 {
			graph [label=try]
			item_38 [label="this->__dt_comp()"]
		}
		subgraph cluster_item_39 {
			graph [label=finally]
			item_40 [label="::[--no entry--](this, 16)"]
		}
		item_38 -> item_40
	}
	item_34 -> item_38 [style=invis]
	subgraph cluster_item_41 {
		graph [label="::item::ExampleA::methodA1() -> int"]
		item_42 [label="int ret = 5"]
		item_43 [label="::item::EmptyExamle emptyObj"]
		item_42 -> item_43
		item_44 [label="int __tmp_906 = ::item::funcA(this)"]
		item_43 -> item_44
		item_45 [label="ret = ret + __tmp_906"]
		item_44 -> item_45
		item_46 [label="return ret" fillcolor=lightgreen]
		item_47 [label="" fillcolor=black fixedsize=true height=0.12 shape=doublecircle size=0.1 width=0.12]
		item_46 -> item_47
		item_45 -> item_46
	}
	item_40 -> item_42 [style=invis]
}
